{
  "showcase": "Showcase",
  "about": "About me",
  "send_message": "Get in touch",
  "hello": "Hello,",
  "im_eduardo": "I'm Eduardo Dourado;",
  "bio": "Backend-focused Full-Stack Developer specializing in building robust and scalable APIs with Python (Django) and Node.js. Experienced in microservices architecture, PostgreSQL data modeling, and complex transactional systems. Proven ability in developing authentication systems, data management solutions, and business logic, along with integrating external services and optimizing internal workflows. Seeking to leverage my skills to create high-impact solutions that merge efficiency, security, and user experience.",
  "showcase_title": "Selected Projects",
  "showcase_subtitle": "A collection of my most exciting and key projects, showcasing my skills and efficiency",
  "case_study": "View on GitHub",
  "project1_title": "Memphis",
  "project1_description": "Integrating knowledge, culture, and practice, Memphis is a scalable music platform. It uses Node.js, Express & MongoDB in a layered architecture, containerization with Docker, JWT authentication, and integration with Spotify",
  "project2_title": "Cairo",
  "project2_description": "Cairo is a food ordering system focused on speed and simplicity, built upon a 100% RESTful API. It features Next.js + TypeScript, Prisma for ORM, Zod for validation, PostgreSQL as the database, and payments via Stripe",
  "details_title": "Details",
  "details_subtitle": "Here's a closer look at the tools and technologies I'm currently using to bring to life ideas. From frontend and backend integrations to data analysis, problem-solving and different design approaches",
  "skill1": "HTML, CSS",
  "skill2": "JavaScript (and TypeScript), Python",
  "skill3": "Django, React, Next.js, Prisma",
  "skill4": "PostgreSQL, MongoDB",
  "skill5": "Git, GitHub",
  "skill6": "UI/UX Design",
  "thank_you": "Thank You!",
  "echoes": "Echoes find echoes;",
  "footer_subtitle": "send me a message! Or drop your thoughts:",
  "send_message_btn": "Send a Message",
  "color_palette": "Color palette:",
  "rights_reserved": "All rights reserved."
}